app/Controllers/Home.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'dhikapranata@gmail.com'
 LIMIT 1
---
    public function cek()
    {

        // $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        // $hashedPassword = password_hash($password, PASSWORD_DEFAULT);
        // var_dump($nama,$email,$password,$hashedPassword);
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

INSERT INTO `tbl_user` (`nama`, `email`, `password`) VALUES ('Dika', 'dhikapranata@gmail.com', '$2y$10$e3tdY/NKc4mk1mR9TozYPeQPpt3k299HAnWbB3TOb41ZzVrmqbLYS')
---
    public function registerSubmit()
    {

        $nama = $this->request->getPost('nama');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

        $userModel = new UserModel();
        $data = [
            'nama' => $nama,
            'email' => $email,
            'password' => $hashedPassword,
        ];
        $userModel->insert($data);